; domain
(define (domain hanoi)
(:requirements :strips)
(:predicates (clear ?x)
             (on ?x ?y)
             (smaller ?x ?y))

(:action move
:parameters (?disc ?from ?to)
:precondition (and (smaller ?disc ?to) 
                   (on ?disc ?from) 
                   (clear ?disc) 
                   (clear ?to))
:effect  (and (clear ?from) 
              (on ?disc ?to) 
              (not (on ?disc ?from))  
              (not (clear ?to)))
 ))

; problem
(define (problem hanoi1)
    (:domain hanoi)
    (:objects
        peg1 peg2 peg3
        orange_disk red_disk blue_disk green_disk pink_disk yellow_disk cyan_disk
    )
    (:init
        (clear cyan_disk)
        (clear peg2)
        (clear peg3)
        (on cyan_disk yellow_disk)
        (on yellow_disk pink_disk)
        (on pink_disk green_disk)
        (on green_disk blue_disk)
        (on blue_disk red_disk)
        (on red_disk orange_disk)
        (on orange_disk peg1)
        (smaller cyan_disk peg1)
        (smaller yellow_disk peg1)
        (smaller pink_disk peg1)
        (smaller green_disk peg1)
        (smaller blue_disk peg1)
        (smaller red_disk peg1)
        (smaller orange_disk peg1)
        (smaller cyan_disk peg2)
        (smaller yellow_disk peg2)
        (smaller pink_disk peg2)
        (smaller green_disk peg2)
        (smaller blue_disk peg2)
        (smaller red_disk peg2)
        (smaller orange_disk peg2)
        (smaller cyan_disk peg3)
        (smaller yellow_disk peg3)
        (smaller pink_disk peg3)
        (smaller green_disk peg3)
        (smaller blue_disk peg3)
        (smaller red_disk peg3)
        (smaller orange_disk peg3)
        (smaller cyan_disk yellow_disk)
        (smaller cyan_disk pink_disk)
        (smaller cyan_disk green_disk)
        (smaller cyan_disk blue_disk)
        (smaller cyan_disk red_disk)
        (smaller cyan_disk orange_disk)
        (smaller yellow_disk pink_disk)
        (smaller yellow_disk green_disk)
        (smaller yellow_disk blue_disk)
        (smaller yellow_disk red_disk)
        (smaller yellow_disk orange_disk)
        (smaller pink_disk green_disk)
        (smaller pink_disk blue_disk)
        (smaller pink_disk red_disk)
        (smaller pink_disk orange_disk)
        (smaller green_disk blue_disk)
        (smaller green_disk red_disk)
        (smaller green_disk orange_disk)
        (smaller blue_disk red_disk)
        (smaller blue_disk orange_disk)
        (smaller red_disk orange_disk)
    )
    (:goal (and 
        (on orange_disk peg3)
        (on red_disk orange_disk)
        (on blue_disk red_disk)
        (on green_disk blue_disk)
        (on pink_disk green_disk)
        (on yellow_disk pink_disk)
        (on cyan_disk yellow_disk)
    ))
)

; plan
1. (move cyan_disk yellow_disk peg3)
   deleted: (on cyan_disk yellow_disk) (clear peg3)
   added: (clear yellow_disk) (on cyan_disk peg3)
   goals met: 5 of 7
2. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 4 of 7
3. (move cyan_disk peg3 yellow_disk)
   deleted: (on cyan_disk peg3) (clear yellow_disk)
   added: (clear peg3) (on cyan_disk yellow_disk)
   goals met: 5 of 7
4. (move pink_disk green_disk peg3)
   deleted: (on pink_disk green_disk) (clear peg3)
   added: (clear green_disk) (on pink_disk peg3)
   goals met: 4 of 7
5. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
6. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 4 of 7
7. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
8. (move green_disk blue_disk peg2)
   deleted: (on green_disk blue_disk) (clear peg2)
   added: (clear blue_disk) (on green_disk peg2)
   goals met: 4 of 7
9. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
10. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 7
11. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
12. (move pink_disk peg3 green_disk)
   deleted: (on pink_disk peg3) (clear green_disk)
   added: (clear peg3) (on pink_disk green_disk)
   goals met: 4 of 7
13. (move cyan_disk yellow_disk peg3)
   deleted: (on cyan_disk yellow_disk) (clear peg3)
   added: (clear yellow_disk) (on cyan_disk peg3)
   goals met: 3 of 7
14. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 7
15. (move cyan_disk peg3 yellow_disk)
   deleted: (on cyan_disk peg3) (clear yellow_disk)
   added: (clear peg3) (on cyan_disk yellow_disk)
   goals met: 5 of 7
16. (move blue_disk red_disk peg3)
   deleted: (on blue_disk red_disk) (clear peg3)
   added: (clear red_disk) (on blue_disk peg3)
   goals met: 4 of 7
17. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 3 of 7
18. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 7
19. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
20. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 2 of 7
21. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 1 of 7
22. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 7
23. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
24. (move green_disk peg2 blue_disk)
   deleted: (on green_disk peg2) (clear blue_disk)
   added: (clear peg2) (on green_disk blue_disk)
   goals met: 4 of 7
25. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
26. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 2 of 7
27. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
28. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 4 of 7
29. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 3 of 7
30. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 4 of 7
31. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
32. (move red_disk orange_disk peg2)
   deleted: (on red_disk orange_disk) (clear peg2)
   added: (clear orange_disk) (on red_disk peg2)
   goals met: 4 of 7
33. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 3 of 7
34. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 2 of 7
35. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
36. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 2 of 7
37. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 1 of 7
38. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 2 of 7
39. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
40. (move green_disk blue_disk orange_disk)
   deleted: (on green_disk blue_disk) (clear orange_disk)
   added: (clear blue_disk) (on green_disk orange_disk)
   goals met: 2 of 7
41. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 1 of 7
42. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 0 of 7
43. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 1 of 7
44. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 2 of 7
45. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 1 of 7
46. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 7
47. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
48. (move blue_disk peg3 red_disk)
   deleted: (on blue_disk peg3) (clear red_disk)
   added: (clear peg3) (on blue_disk red_disk)
   goals met: 4 of 7
49. (move cyan_disk yellow_disk peg3)
   deleted: (on cyan_disk yellow_disk) (clear peg3)
   added: (clear yellow_disk) (on cyan_disk peg3)
   goals met: 3 of 7
50. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 7
51. (move cyan_disk peg3 yellow_disk)
   deleted: (on cyan_disk peg3) (clear yellow_disk)
   added: (clear peg3) (on cyan_disk yellow_disk)
   goals met: 3 of 7
52. (move pink_disk green_disk peg3)
   deleted: (on pink_disk green_disk) (clear peg3)
   added: (clear green_disk) (on pink_disk peg3)
   goals met: 2 of 7
53. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 1 of 7
54. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 7
55. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
56. (move green_disk orange_disk blue_disk)
   deleted: (on green_disk orange_disk) (clear blue_disk)
   added: (clear orange_disk) (on green_disk blue_disk)
   goals met: 4 of 7
57. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
58. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 2 of 7
59. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
60. (move pink_disk peg3 green_disk)
   deleted: (on pink_disk peg3) (clear green_disk)
   added: (clear peg3) (on pink_disk green_disk)
   goals met: 4 of 7
61. (move cyan_disk yellow_disk peg3)
   deleted: (on cyan_disk yellow_disk) (clear peg3)
   added: (clear yellow_disk) (on cyan_disk peg3)
   goals met: 3 of 7
62. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 4 of 7
63. (move cyan_disk peg3 yellow_disk)
   deleted: (on cyan_disk peg3) (clear yellow_disk)
   added: (clear peg3) (on cyan_disk yellow_disk)
   goals met: 5 of 7
64. (move orange_disk peg1 peg3)
   deleted: (on orange_disk peg1) (clear peg3)
   added: (clear peg1) (on orange_disk peg3)
   goals met: 6 of 7
65. (move cyan_disk yellow_disk peg1)
   deleted: (on cyan_disk yellow_disk) (clear peg1)
   added: (clear yellow_disk) (on cyan_disk peg1)
   goals met: 5 of 7
66. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 4 of 7
67. (move cyan_disk peg1 yellow_disk)
   deleted: (on cyan_disk peg1) (clear yellow_disk)
   added: (clear peg1) (on cyan_disk yellow_disk)
   goals met: 5 of 7
68. (move pink_disk green_disk peg1)
   deleted: (on pink_disk green_disk) (clear peg1)
   added: (clear green_disk) (on pink_disk peg1)
   goals met: 4 of 7
69. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
70. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 4 of 7
71. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
72. (move green_disk blue_disk orange_disk)
   deleted: (on green_disk blue_disk) (clear orange_disk)
   added: (clear blue_disk) (on green_disk orange_disk)
   goals met: 4 of 7
73. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
74. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 7
75. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
76. (move pink_disk peg1 green_disk)
   deleted: (on pink_disk peg1) (clear green_disk)
   added: (clear peg1) (on pink_disk green_disk)
   goals met: 4 of 7
77. (move cyan_disk yellow_disk peg1)
   deleted: (on cyan_disk yellow_disk) (clear peg1)
   added: (clear yellow_disk) (on cyan_disk peg1)
   goals met: 3 of 7
78. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 7
79. (move cyan_disk peg1 yellow_disk)
   deleted: (on cyan_disk peg1) (clear yellow_disk)
   added: (clear peg1) (on cyan_disk yellow_disk)
   goals met: 5 of 7
80. (move blue_disk red_disk peg1)
   deleted: (on blue_disk red_disk) (clear peg1)
   added: (clear red_disk) (on blue_disk peg1)
   goals met: 4 of 7
81. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 3 of 7
82. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 7
83. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
84. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 2 of 7
85. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 1 of 7
86. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 7
87. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
88. (move green_disk orange_disk blue_disk)
   deleted: (on green_disk orange_disk) (clear blue_disk)
   added: (clear orange_disk) (on green_disk blue_disk)
   goals met: 4 of 7
89. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
90. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 2 of 7
91. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
92. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 4 of 7
93. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 3 of 7
94. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 4 of 7
95. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
96. (move red_disk peg2 orange_disk)
   deleted: (on red_disk peg2) (clear orange_disk)
   added: (clear peg2) (on red_disk orange_disk)
   goals met: 6 of 7
97. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 5 of 7
98. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 4 of 7
99. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
100. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 4 of 7
101. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
102. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 4 of 7
103. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
104. (move green_disk blue_disk peg2)
   deleted: (on green_disk blue_disk) (clear peg2)
   added: (clear blue_disk) (on green_disk peg2)
   goals met: 4 of 7
105. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
106. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 7
107. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 3 of 7
108. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 4 of 7
109. (move cyan_disk yellow_disk red_disk)
   deleted: (on cyan_disk yellow_disk) (clear red_disk)
   added: (clear yellow_disk) (on cyan_disk red_disk)
   goals met: 3 of 7
110. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 7
111. (move cyan_disk red_disk yellow_disk)
   deleted: (on cyan_disk red_disk) (clear yellow_disk)
   added: (clear red_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
112. (move blue_disk peg1 red_disk)
   deleted: (on blue_disk peg1) (clear red_disk)
   added: (clear peg1) (on blue_disk red_disk)
   goals met: 6 of 7
113. (move cyan_disk yellow_disk peg1)
   deleted: (on cyan_disk yellow_disk) (clear peg1)
   added: (clear yellow_disk) (on cyan_disk peg1)
   goals met: 5 of 7
114. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 4 of 7
115. (move cyan_disk peg1 yellow_disk)
   deleted: (on cyan_disk peg1) (clear yellow_disk)
   added: (clear peg1) (on cyan_disk yellow_disk)
   goals met: 5 of 7
116. (move pink_disk green_disk peg1)
   deleted: (on pink_disk green_disk) (clear peg1)
   added: (clear green_disk) (on pink_disk peg1)
   goals met: 4 of 7
117. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 3 of 7
118. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 7
119. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
120. (move green_disk peg2 blue_disk)
   deleted: (on green_disk peg2) (clear blue_disk)
   added: (clear peg2) (on green_disk blue_disk)
   goals met: 6 of 7
121. (move cyan_disk yellow_disk green_disk)
   deleted: (on cyan_disk yellow_disk) (clear green_disk)
   added: (clear yellow_disk) (on cyan_disk green_disk)
   goals met: 5 of 7
122. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 4 of 7
123. (move cyan_disk green_disk yellow_disk)
   deleted: (on cyan_disk green_disk) (clear yellow_disk)
   added: (clear green_disk) (on cyan_disk yellow_disk)
   goals met: 5 of 7
124. (move pink_disk peg1 green_disk)
   deleted: (on pink_disk peg1) (clear green_disk)
   added: (clear peg1) (on pink_disk green_disk)
   goals met: 6 of 7
125. (move cyan_disk yellow_disk peg1)
   deleted: (on cyan_disk yellow_disk) (clear peg1)
   added: (clear yellow_disk) (on cyan_disk peg1)
   goals met: 5 of 7
126. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 6 of 7
127. (move cyan_disk peg1 yellow_disk)
   deleted: (on cyan_disk peg1) (clear yellow_disk)
   added: (clear peg1) (on cyan_disk yellow_disk)
   goals met: 7 of 7
